bench/results/java17/20260309T215256Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6461.68, "p50": "3.48ms", "p95": "6.88ms", "p99": "8.20ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.72ms    1.43ms  29.76ms   72.45%\n    Req/Sec     1.62k   161.27     1.98k    72.17%\n  Latency Distribution\n     50%    3.48ms\n     75%    4.47ms\n     90%    5.57ms\n     99%    8.20ms\n  775660 requests in 2.00m, 176.79MB read\nRequests/sec:   6461.68\nTransfer/sec:      1.47MB"}